Tekla.Structures.Model.History.ModelHistory
The ModelHistory class provides history information about the objects of the model
that is currently open in Tekla Structures.
using Tekla.Structures.Model;
using Tekla.Structures.Model.History;
using System;
using System.Diagnostics;
public class Example
{
public void Example1()
{
ModificationStamp ModStamp = new ModificationStamp();
bool SuccessFlag = true;
ModelObjectEnumerator modelEnum = ModelHistory.GetModifiedObjects(ModStamp);
while (modelEnum.MoveNext())
{
ModelObject mo = modelEnum.Current;
if (mo.Identifier.ID < ModStamp.LocalStamp)
{
SuccessFlag = false;
Console.WriteLine("!!!Wrong modified id: " + mo.Identifier.ID);
}
else
{
Console.WriteLine("Next correct modified id: " + mo.Identifier.ID);
}
}
ModStamp = ModelHistory.GetCurrentModificationStamp();
Console.WriteLine("Current ModStamp: {0}", ModStamp.LocalStamp);
Debug.Assert(Equals(SuccessFlag, true), "Incorrect modified id came up.");
Debug.Assert(ModStamp != null, "Modification stamp does not exist.");
}
}